// 1.Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
let a = 10;
let b = 3;
console.log(a % b);

// 2.Возведите 2 в 10 степень. Результат запишите в переменную st.
let st = 2 ** 10;
console.log(st);

// 3.Имеется три переменные a = 1, b = 2, c = " белых медведей". Сложите переменные так, чтобы в результате получилось выражение: "12 белых медведей".
const c = "1";
const d = "2";
const e = " белых медведей";

console.log(c + d + e);

// 4..Запустив следующий код, вы получите число 16. Что нужно изменить, чтобы получить число 15? let a = 5; let b = 10, let c ; c = ++a + b--;
let q = 5;
let w = 10;
let z;
z = q++ + w--;
console.log(z);

// 5. Запустив следующий код, вы получите число 30. Ваша задача расставить приоритетные скобки () так, чтобы получить число -390. const x = 15 * 4 + 25 - 55;
const x = 15 * (4 + 25 - 55);
console.log(x);
